jekyll/projects.html
---
layout: page
title: /projects
permalink: /projects/
---

<div id="outline-container-org533a84a" class="outline-2">
<h2 id="org533a84a">Kratedrop.com</h2>
<div class="outline-text-2" id="text-org533a84a">
<p>
<b><b>Role</b></b>: Concept to Execution (Architect, Development, Infrastructure)
<b><b>Stack</b></b>: Laravel 5.5 (PHP7), Laravel Echo, Vue.JS 2, SASS
<b><b>API</b></b>: Bitcoin RPC, Ethereum RPC, Steam API, Stripe API
<b><b>STATUS</b></b>: Ran for couple months over 5000+ users and <b>SOLD</b>
</p>

<p>
Online platform that offers a unique and engaging experience for gamers and collectors. The platform allows users to participate in a variety of events, including drops and auctions, to acquire rare and exclusive gaming items, such as skins, weapons, and accessories for the steam game PUBG.
</p>

<p>
There were multiple sub-systems that were also done by me and shared with other projects:
</p>
</div>
<div id="outline-container-org371c52e" class="outline-4">
<h4 id="org371c52e">Provably Fair</h4>
<div class="outline-text-4" id="text-org371c52e">
<p>
A provably fair system is an algorithm or protocol used in online games and gambling platforms to ensure that the game outcomes are fair and transparent. The system generates a random number using a cryptographic algorithm that cannot be predicted or manipulated. This random number is provided to the player before the game starts, along with a hash or digital fingerprint. Once the game is complete, the system generates another hash and compares it with the hash provided to the player. If they match, the player can be confident that the game was fair and the outcome was not manipulated. It is an essential feature for any reputable online gaming or gambling platform, providing players with complete transparency and peace of mind.
</p>
</div>
</div>

<div id="outline-container-org2fe2ee3" class="outline-4">
<h4 id="org2fe2ee3">Steam Inventory Bot</h4>
<div class="outline-text-4" id="text-org2fe2ee3">
<p>
A powerful Node.js bot that was able to manage Steam inventories for multiple accounts and seamlessly handle trades between users of the platform. This bot was designed to simplify the trading process and automate inventory management, providing users with a streamlined and efficient trading experience.
It was mainly developed in Node.js using Steam API, and various trading libraries. I also implemented advanced security measures to ensure that the system was fully secure and that multiple steam accounts were protected at all times.
There were complex scenarios were we must handle generation of TOTP tokens and keep the different secrets for different accounts all in sync.
Overall, this system has been highly successful and has provided users with a fast and reliable way to trade their Steam inventory items.
It has been also reused in other projects.
</p>
</div>
</div>
</div>



<div id="outline-container-org3717836" class="outline-2">
<h2 id="org3717836">Others</h2>
</div>
